{
  "mainPost": {
    "category": "Morning Routine",
    "date": "12 hours ago",
    "title": "I Stopped Reaching for My Phone First Thing—and My Mornings Got So Much Better",
    "excerpt": "The “no-scroll morning” routine that keeps me grounded and energized.",
    "image": "https://images.unsplash.com/photo-1584308972272-9e4e7685e80f?q=80&w=880&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "content": "<p>Waking up without instantly scrolling through my phone was something I never thought I could do. For years, my mornings began with a flood of notifications, social media updates, and emails. It felt productive, but in reality, it left me overwhelmed before I even left bed. The first morning I resisted the urge to grab my phone, I noticed something surprising—my thoughts felt clearer, and I actually had a moment to breathe before the day began.</p><p>Instead of diving straight into the digital noise, I now spend the first fifteen minutes stretching, sipping a glass of water, and focusing on my breathing. It’s simple, but this ritual sets a calm tone for the rest of the day. I’ve noticed my mind feels less scattered, and I’m more present in everything I do afterwards. Those minutes feel like a gift to myself—a space where the outside world doesn’t intrude.</p><p>Of course, breaking the habit wasn’t easy. For the first week, my fingers would itch to check my notifications, and I would wonder what I was missing out on. But that fear faded once I realized how much better my mornings felt without it. I started replacing the scrolling time with journaling—just jotting down a few thoughts, dreams, or to-do lists. It’s amazing how much that simple switch can improve your clarity for the day ahead.</p><p>Another benefit I didn’t expect? My mornings feel longer. Without the black hole of endless scrolling, I suddenly have time to make breakfast, tidy my space, or step outside for a quick walk. These small moments ground me before the chaos of the day. I’ve even noticed I’m more likely to follow through on my morning workout when I don’t start the day glued to my screen.</p><p>Over time, this change has affected more than just my mornings—it’s influenced the way I use my phone overall. I’m more intentional with my screen time, and I’m quicker to put my phone down in the evenings as well. The more I detach from that constant digital pull, the more space I have for real-life experiences. In the end, not reaching for my phone first thing has given me something I didn’t even realize I was missing: my mornings back.</p><p>If you’ve been feeling rushed, stressed, or unfocused before the day even begins, I can’t recommend this enough. Try putting your phone on the other side of the room before bed, and give yourself just fifteen tech-free minutes in the morning. You might be surprised how quickly those minutes turn into your favorite part of the day.</p>",
    "contentImg": "https://images.unsplash.com/photo-1670437664511-1f4e3442aa68?q=80&w=880&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
  },
  "sidePosts": [
    {
      "category": "Skincare",
      "date": "Aug. 10, 2025",
      "title": "Exactly How To Add Tretinoin to Your Skincare Routine—Without Overhauling Your Entire Regimen",
      "excerpt": "Your step-by-step guide to the popular retinoid.",
      "image": "https://images.unsplash.com/photo-1608979048467-6194dabc6a3d?q=80&w=880&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "content": "<p>Tretinoin has long been considered a gold standard ingredient in dermatology, thanks to its proven ability to improve skin texture, reduce fine lines, and treat acne. But if you’ve never used it before, the thought of adding such a potent ingredient into your routine can feel intimidating. The key is to start slow, be patient, and understand that consistency—not drastic overnight change—is what delivers results.</p><p>When I first introduced tretinoin into my skincare routine, I made the mistake of applying it nightly. Within a week, my skin was red, flaky, and irritated. I learned the hard way that this is a marathon, not a sprint. The smarter approach is to start with a pea-sized amount twice a week, allowing your skin to adjust gradually. This prevents excessive dryness and gives you a better chance of sticking with the routine long-term.</p><p>Moisturizing is non-negotiable when you’re using tretinoin. A gentle, hydrating moisturizer applied both before and after the tretinoin can help create a buffer that reduces irritation without blocking its effectiveness. Think of it like cushioning for your skin—it still gets the benefits, but without as much of the sting.</p><p>Another crucial step is sun protection. Tretinoin can make your skin more sensitive to UV rays, so daily sunscreen is essential. Even if you’re mostly indoors, UVA rays can penetrate windows, leading to further sensitivity or hyperpigmentation. This is one of those times when SPF really makes a difference you can see in the mirror over time.</p><p>After several months of careful use, the changes became undeniable. My skin looked smoother, my pores appeared smaller, and those pesky post-acne marks faded significantly. The best part? I didn’t have to replace my entire skincare shelf. With just a few adjustments—adding tretinoin, prioritizing moisturizer, and religiously using SPF—I was able to elevate my routine without overcomplicating it.</p><p>If you’ve been curious about tretinoin but hesitant to try, remember this: it’s not about instant results, it’s about steady improvement. Give your skin time to adapt, and you might just find it becomes one of the most transformative products in your lineup.</p>",
      "contentImg": "https://images.unsplash.com/photo-1686232132375-b94c904dbb88?q=80&w=821&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
    },
    {
      "category": "Breathing Space",
      "date": "Aug. 09, 2025",
      "title": "The Best Books I’ve Read This Year (So Far)",
      "excerpt": "The novel I couldn’t put down, an anxiety reframe, and the unexpectedly great cookbook...",
      "image": "https://images.unsplash.com/photo-1499332251574-a76a01d733fc?q=80&w=833&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "content": "<p>This year has been an unexpected treasure trove of great reads. I’ve explored genres I usually skip, taken recommendations from friends I barely agreed with before, and even stumbled upon books in tiny secondhand stores that ended up changing my perspective entirely. There’s something magical about finding the right book at the right time—it feels almost like fate.</p><p>The first standout of my year was a novel so gripping that I finished it in two sittings. The characters felt like real people I knew, and the writing was so vivid that I could almost smell the coffee in the café scenes. It wasn’t just a story—it was an experience that stayed with me long after I closed the final page.</p><p>On the non-fiction side, I discovered a book on anxiety that reframed the way I think about stress entirely. Instead of seeing anxiety as something to “fix” or “eliminate,” the author suggested treating it as a signal—an invitation to slow down, reassess, and act with more intention. That shift in mindset has been just as valuable as any self-care habit I’ve picked up this year.</p><p>Perhaps the biggest surprise was a cookbook. I’m not someone who typically reads cookbooks cover to cover, but this one was different. It was as much about storytelling as it was about recipes. Each dish came with an anecdote—whether about a grandmother’s kitchen in the countryside or a chaotic dinner party that somehow turned out perfectly. Cooking from its pages felt like being part of those stories.</p><p>These books have reminded me why I love reading in the first place—it’s not just about entertainment, it’s about connection. Whether to the characters, the author, or even parts of yourself you didn’t know were waiting to be found, a good book pulls you in and leaves you changed. And in a year that’s been anything but predictable, that kind of transformation is priceless.</p><p>If you’re looking for something new to read, I’d encourage you to step outside your usual genre. You never know when the next book you pick up might just become the best one you’ve read all year.</p>",
      "contentImg": "https://images.unsplash.com/photo-1659457006089-84c8c158ff21?q=80&w=917&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
    },
    {
      "category": "Salads",
      "date": "Aug. 08, 2025",
      "title": "The Mediterranean Tuna Salad That’s Giving South of France",
      "excerpt": "Aka dinner when it’s too hot to turn on the stove.",
      "image": "https://images.unsplash.com/photo-1633368475182-7c4773552630?q=80&w=880&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "content": "<p>When summer temperatures soar, the last thing I want is to turn on the stove. That’s where this Mediterranean-inspired tuna salad comes in—a dish so fresh, vibrant, and satisfying that it feels like a mini vacation to the south of France. It’s light enough to keep you cool, but hearty enough to count as a proper dinner.</p><p>The base of this salad is high-quality tuna packed in olive oil, which makes all the difference in flavor. I combine it with juicy cherry tomatoes, crisp cucumber, briny olives, and thinly sliced red onion for a burst of freshness. A sprinkle of capers adds a salty punch, while fresh parsley and basil bring the whole dish to life.</p><p>The dressing is simple but powerful: good extra virgin olive oil, a squeeze of lemon juice, a touch of Dijon mustard, and a pinch of flaky sea salt. Toss everything together gently so the tuna stays in satisfying chunks. The flavors mingle beautifully if you let the salad sit for about 15 minutes before serving.</p><p>What I love most is how versatile this dish is. You can serve it over a bed of greens, pile it onto toasted sourdough, or even stuff it into pita bread for a portable lunch. I’ve also swapped in white beans for extra protein, or added grilled zucchini when I had some on hand—it’s hard to go wrong.</p><p>Pairing this salad with a chilled glass of white wine or sparkling water with lemon makes the experience even more reminiscent of a seaside café. And if you’re feeling indulgent, a small slice of fresh-baked focaccia on the side turns it into a truly memorable meal.</p><p>In the end, this tuna salad isn’t just about convenience—it’s about creating a little moment of joy in the middle of a sweltering day. With every bite, you can almost hear the waves crashing and smell the salt in the air. And honestly, who couldn’t use a taste of the Mediterranean right about now?</p>",
      "contentImg": "https://images.unsplash.com/photo-1670437664511-1f4e3442aa68?q=80&w=880&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
    }
  ]
}
